docs/database.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-08 Tue 22:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Koios Orbit Database</title>
<meta name="author" content="Mathieu Gatsonides" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Koios Orbit Database</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0ba4137">1. Introduction</a></li>
<li><a href="#org233864b">2. STRUCTURE</a>
<ul>
<li><a href="#org165fd00">2.1. Authentication</a></li>
<li><a href="#org7cb81ab">2.2. Template</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0ba4137" class="outline-2">
<h2 id="org0ba4137"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The koios education platform uses a decentralized database to store all world and course data. User data will/can be stored by using <a href="https://developers.ceramic.network/streamtypes/overview/">Ceramic Streamtypes</a>. Non user data for instance Worlds, Lessons and Literature will be stored on <a href="https://github.com/ipfs/ipfs">IPFS</a> in a decentralized peer to peer database called <a href="https://github.com/orbitdb/orbit-db">OrbitDB</a>.
</p>
</div>
</div>

<div id="outline-container-org233864b" class="outline-2">
<h2 id="org233864b"><span class="section-number-2">2.</span> STRUCTURE</h2>
<div class="outline-text-2" id="text-2">
<p>
The current filestructure for storing non user data is based upon multiple json files. These json files hold info about all non user data. Also they refer to other json files to get a structured layered design/format. Orbitdb&rsquo;s <a href="https://github.com/orbitdb/orbit-db-docstore">docstore</a> is a decentralised datastorage solution of OrbitDB which is the most similar to our current filestructure. An OrbitDB docsore stores json documents which can be indexed.
</p>
</div>


<div id="outline-container-org165fd00" class="outline-3">
<h3 id="org165fd00"><span class="section-number-3">2.1.</span> Authentication</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Orbitdb&rsquo;s data is stored on ipfs. Which means every peer (participant) has read permissions on the data put into these database instances. Even though read-permissions aren&rsquo;t configurable, write-permissions are.
Write-permissions are determined by the <a href="https://github.com/orbitdb/orbit-db/blob/main/GUIDE.md#custom-access-controller">access controller</a> object added to the orbitdb instance in the objects properties.
Since permissions can only be set and determined at db-instance level, every world should be separated in its own world-db-instance to enable multilayer permissions. Eventually, every world-db-instances should be put inside a parent db to index all worlds. Using the aforementioned structure enables to set the permission for each distinct world.
</p>
</div>
</div>

<div id="outline-container-org7cb81ab" class="outline-3">
<h3 id="org7cb81ab"><span class="section-number-3">2.2.</span> Template</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<b>Top Level world-db holding all world-instances</b>
</p>

<p>
Template in json
</p>
<div class="org-src-container">
<pre class="src src-js">{
    course: <span style="color: #98be65;">"worldname"</span>,
    CID: <span style="color: #98be65;">"orbitCID"</span>
}
</pre>
</div>

<p>
<b>One world-instance (course-instance)</b>
Template in json
</p>
<div class="org-src-container">
<pre class="src src-js">{
    course: <span style="color: #98be65;">"coursename"</span>,
    url: <span style="color: #98be65;">"url"</span>,
    description: <span style="color: #98be65;">"description"</span>,
    quiz: <span style="color: #98be65;">"quiz"</span>,
    quickLinks:{
                {
                    linkTitle: <span style="color: #98be65;">"Course info"</span>,
                    linkUrl: <span style="color: #98be65;">"https://"</span>
                },
                {
                    linkTitle: <span style="color: #98be65;">"Course info"</span>,
                    linkUrl: <span style="color: #98be65;">"https://"</span>
                }
               },
    content:{
                {
                    title: <span style="color: #98be65;">"Blockchain level 1"</span>,
                    videoinfo: {},
                    data: {},
                    subtitle: <span style="color: #98be65;">"Basic introduction"</span>
                },
                {}
            },
    earn:{
            {
                title: <span style="color: #98be65;">"Sidejobs"</span>,
                linkUrl: <span style="color: #98be65;">"/link"</span>
            },
            {}
         },
    connect:{
                title: <span style="color: #98be65;">"Blackbirds"</span>,
                linkUrl: <span style="color: #98be65;">"/link"</span>
            },
            {}
    team:{
            subtitle: <span style="color: #98be65;">"When you join koios"</span>,
            p1: <span style="color: #98be65;">"This includes Field experts"</span>,
            p2: <span style="color: #98be65;">""</span>,
            members:{
                        {
                            name: <span style="color: #98be65;">"Gerard Persoon"</span>,
                            imageUrl : <span style="color: #98be65;">"https://cdn.discordapp.com/avatars/525687122233917471/a5206ac46ce91d176a22b99ce947ef2d.png?size=256"</span>
                            description : <span style="color: #98be65;">"Deep into the technical details of blockchains"</span>
                            twitterLink : <span style="color: #98be65;">"https://twitter.com/gpersoon"</span>
                            twitterHandle : <span style="color: #98be65;">"@gpersoon"</span>
                            discordLink : <span style="color: #98be65;">"https://discord.com/users/525687122233917471"</span>
                            discordHandle : <span style="color: #98be65;">"Gerard Persoon"</span>
                        },
                        {}
                    }
         }
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mathieu Gatsonides</p>
<p class="date">Created: 2022-02-08 Tue 22:04</p>
</div>
</body>
</html>
